README.org
#+AUTHOR: Antonio Petrillo
#+TITLE: Emacs Config

* To setup 
+ csv, json, yaml, edn ....
+ docker/podman
+ tramp
+ mail setup (notmuch)

* Early Init file
#+begin_src emacs-lisp :tangle "early-init.el"
;;; early-init.el --- Doom's universal bootstrapper -*- lexical-binding: t -*-
#+end_src

I use the directory specified in /nto-cache/ to store any part of the configuration that litter the *user-emacs-directory*.
#+begin_src emacs-lisp :tangle "early-init.el"
(defvar nto-cache (file-name-concat (getenv "HOME") ".config/nto.d"))

(unless (file-exists-p nto-cache)
  (make-directory nto-cache t))
#+end_src

Tell emacs to store all the extra information inside the /cache/ and keep the config direcotry clean.
#+begin_src emacs-lisp :tangle "early-init.el"
(startup-redirect-eln-cache (expand-file-name "eln" nto-cache))
(setq package-user-dir (expand-file-name "elpa" nto-cache))

(setq no-littering-etc-directory (expand-file-name "etc" nto-cache))
(setq no-littering-var-directory (expand-file-name "var" nto-cache))

(setq custom-file (file-name-concat nto-cache "custom.el"))
(load custom-file :no-error-if-file-is-missing)

(setq make-backup-files nil)
(setq create-lockfiles nil)

(setq package-enable-at-startup nil)
(setq evil-want-keybinding nil)
(setq use-short-answers t)
(setq ring-bell-function 'ignore)
#+end_src

On startup open emacs on a scratch buffer in fundamental mode, also enable truncate lines.
#+begin_src emacs-lisp :tangle "early-init.el"
(setq inhibit-splash-screen t)
(setq-default truncate-lines t)
(setq inhibit-startup-screen t)
#+end_src

Stolen (as many other things) from [[https://github.com/doomemacs/doomeacs][doomemacs]] early init.
As they report, disabling /scroll-bar/, /menu-bar/ and /tool-bar/ in this way avoid some redraws during startup making it faster. 
#+begin_src emacs-lisp :tangle "early-init.el"
(add-to-list 'default-frame-alist 
             '(menu-bar-lines . 0))
(add-to-list 'default-frame-alist
             '(tool-bar-lines . 0))
(add-to-list 'default-frame-alist
             '(vertical-scroll-bars . nil))

(setq menu-bar-mode nil
      tool-bar-mode nil
      scroll-bar-mode nil)
#+end_src

I prefer to start Emacs as maximized, work well in desktop environment and it is ignored on window manager.
#+begin_src emacs-lisp :tangle "early-init.el"
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

Stolen from [[https://protesilaos.com/emacs/dotemacs][Protesilaos]] (as many other things).
It set the threashold for the garbage collector to the maximum value avoding as many as possible gb collections.
After the init the threashold is set to a more sensible number.
Leaving it at ~most-positive-fixnum~ is a bad idea, emacs will chug a lot memory.
#+begin_src emacs-lisp :tangle "early-init.el"
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

(defvar nto/file-name-handler-alist file-name-handler-alist)
(defvar nto/vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 16 1024 1024)
                  gc-cons-percentage 0.1
                  file-name-handler-alist nto/file-name-handler-alist
                  vc-handled-backends nto/vc-handled-backends)))
#+end_src

#+begin_src emacs-lisp :tangle "early-init.el"
;;; early-init.el ends here
#+end_src

* Init file 
#+begin_src emacs-lisp :tangle "init.el"
;;; init.el -*- lexical-binding: t; -*-
#+end_src

All my modules reside under the ~lisp/~ folder (for now)
#+begin_src emacs-lisp :tangle "init.el"
(add-to-list 'load-path (expand-file-name "lisp/" user-emacs-directory))
#+end_src

I've taken this snippet from [[https://systemcrafters.net/][System Crafters]] I think.
With this config the startup is around: ~0.48~ seconds with ~0~ garbage collections.
#+begin_src emacs-lisp :tangle "init.el"
(defun nto/display-startup-time ()
  (message
   "Emacs loaded in %s with %d garbage collections."
   (format
    "%.2f seconds"
    (float-time
     (time-subtract after-init-time before-init-time)))
   gcs-done))

(add-hook 'emacs-startup-hook #'nto/display-startup-time)
#+end_src

Each module is explained in his own section.
#+begin_src emacs-lisp :tangle "init.el"
(require 'init-elpaca-bootstrap)
(require 'init-emacs)
(require 'init-windows)
(require 'init-dired)
(require 'init-completion)
(require 'init-evil)
(require 'init-jumps)
(require 'init-org)
(require 'init-notes)
(require 'init-ui)
(require 'init-proj)
(require 'init-text-goodies)
(require 'init-snippets)
(require 'init-themes)
(require 'init-fonts)
(require 'init-applications)
(require 'init-eat)
(require 'init-strokes)
(require 'init-eshell)
(require 'init-prog)
#+end_src

Each programming languages is configured separately, with the ~nto/enable-languages~ I can enable/disable them.
To disable a language just remove it from the list.
#+begin_src emacs-lisp :tangle "init.el"
(with-eval-after-load 'init-prog
  (nto/enable-languages
   '(emacs-lisp
     clojure
     go
     odin
     zig
     ocaml)))
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
;;; init.el ends here
#+end_src

* Modules
** Elpaca bootstrap
The first thing to do is to bootstrap the [[https://github.com/progfolio/elpaca][elpaca]] package manager, this configuration is taken straight up (not straight.el).
The only thing I've changed is the ~elpaca-directory~, instead of using the ~user-emacs-directory~ I use the cache directory ~nto-cache~.
#+begin_src emacs-lisp :tangle "lisp/init-elpaca-bootstrap.el" :mkdirp yes
;;; init-elpaca-bootstrap.el -*- lexical-binding: t; -*-

(defvar elpaca-installer-version 0.9)
(defvar elpaca-directory (expand-file-name "elpaca/" nto-cache))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                       :ref nil :depth 1 :inherit ignore
                       :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                       :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
        (elpaca-use-package-mode))

(provide 'init-elpaca-bootstrap)
;;; init-elpaca-bootstrap.el ends here
#+end_src

NOTE: Using *elpaca* I should replace the ~after-init-hook~ with ~elpaca-after-init~.

