init.el
;;; init.el -*- lexical-binding: t; -*-
