README.org
** Configure Builtin packages
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
;;; init-emacs.el -*- lexical-binding: t; -*-
#+end_src

Enhance the ~keyboard-quit~ based on the actual context.
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(defun nto/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))
#+end_src

Change the behaviour of ~backward-kill-word~ that drive me nuts.
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(defun nto/backward-kill-word()
  "Same as `backward-kill-word' but if it is invoked on a white space character
at the beginning of the line it will stop at it, furthermore if it is invoked
on the beginning of the line it will go the end of the previous line instead
of delete the previous word."
  (interactive)
  (let ((same? (save-excursion
                 (let ((orig (line-number-at-pos (point)))
                       (dest (progn
                               (backward-word)
                               (line-number-at-pos (point)))))
                   (eq orig dest))))
        (start? (eq (point) (line-beginning-position))))
    (cond (start? (backward-delete-char 1))
          (same? (backward-kill-word 1))
          (:else (kill-line 0)))))
#+end_src

Configure emacs variable, in order:
- /strokes/ for mouse gestures
- /mouse/ drag files
- add line number on while programming
- enable text folding
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(use-package emacs
  :ensure nil
  :custom
  (strokes-file (expand-file-name "strokes" nto-cache))
  (hl-line-sticky-flag nil)
  (mouse-drag-and-drop-region t)
  (mouse-drag-and-drop-region-cross-program t)
  (mouse-autoselect-window nil)
  (strokes-use-strokes-buffer nil)
  (auto-save-default nil)
  :init
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (add-hook 'prog-mode-hook (lambda () 
			      (display-line-numbers-mode 1)
			      (setq display-line-numbers 'relative)))
  (add-hook 'prog-mode-hook #'hs-minor-mode)
  (define-key global-map (kbd "M-c") nil)
  (define-key global-map (kbd "C-<backspace>") #'nto/backward-kill-word)
  (define-key global-map (kbd "C-g") #'nto/keyboard-quit-dwim)
  (define-key global-map (kbd "<esc>") #'nto/keyboard-quit-dwim)
  (define-key global-map (kbd "<escape>") #'nto/keyboard-quit-dwim)

  (global-set-key (kbd "M-<down-mouse-1>") 'strokes-do-stroke)

  (global-set-key (kbd "C-=") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)

  (global-hl-line-mode)
  (auto-save-mode -1)
  (load-theme 'modus-vivendi))
#+end_src

No littering is not builtin but it is essential to not pollute the config directory.
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(use-package no-littering
  :ensure t)
#+end_src

Overwrite region when writing, no that useful with /evil-mode/ but in a few cases I still use the /emacs-state/. 
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(use-package delsel
  :ensure nil
  :hook (elpaca-after-init . delete-selection-mode))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(use-package electric
  :ensure nil
  :hook
  (prog-mode . electric-pair-mode)
  :config
  (setq electric-pair-pairs '((?\{ . ?\})
			      (?\[ . ?\])
			      (?\( . ?\))
			      (?\" . ?\"))))
#+end_src

Add the bindings for ~tab-bar~ commands, also there is a sneak peek about the ~<leader>~ key.
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(use-package tab-bar
  :bind
  (("<leader> <tab>s" . tab-switch)
   ("<leader> <tab><tab>" . tab-switch)
   ("<leader> <tab>c" . tab-close)
   ("<leader> <tab>n" . tab-new)
   ("<leader> <tab>r" . tab-rename)
   ("<leader> <tab>b" . switch-to-buffer-other-tab)
   ("<leader> <tab>d" . dired-other-tab)))
#+end_src

A brief reminder: I should research a way to customize the tab-bar aspect, it is a great place to put something like a battery indicator. 
#+begin_src emacs-lisp :tangle "lisp/init-emacs.el" :mkdirp yes
(provide 'init-emacs)
;;; lisp/init-emacs.el ends here
#+end_src

** Configure Window managements
Windows here stands for emacs windows, not the OS.

#+begin_src emacs-lisp :tangle "lisp/init-windows.el" :mkdirp yes
;;; init-window.el -*- lexical-binding: t; -*-
#+end_src

Set rules for popup buffers, here a resource on the topic made my [[https://www.youtube.com/watch?v=1-UIzYPn38s&list=PL8Bwba5vnQK3sQdwAbtdvuxUdtKSfOftA&index=6C][Prot]], also the part about occur, grep, etc... is taken from it's config with some minor changes.
#+begin_src emacs-lisp :tangle "lisp/init-windows.el" :mkdirp yes
(setq display-buffer-alist
      `(("\\*Occur\\*"
         (display-buffer-reuse-mode-window display-buffer-below-selected)
         (dedicated . t)
         (window-height . fit-window-to-buffer))

	("\\`\\*Async Shell Command\\*\\'"
	 (display-buffer-no-window))

	("\\`\\*\\(Warnings\\|Compile-Log\\|Org Links\\)\\*\\'"
	 (display-buffer-no-window)
	 (allow-no-window . t))

	((or . ((derived-mode . occur-mode)
		(derived-mode . grep-mode)
		(derived-mode . Buffer-menu-mode)
		(derived-mode . log-view-mode)
		(derived-mode . help-mode)
		"\\*\\(|Buffer List\\|Occur\\|vc-change-log\\|eldoc.*\\).*"))
	 (display-buffer-reuse-window
	  display-buffer-below-selected)
	 (dedicated . t)
	 (window-height . fit-window-to-buffer)
	 (body-function . (lambda (window) (select-window window))))))
#+end_src

Enable winner mode, this allow to have a /history/ of windows configuration.
#+begin_src emacs-lisp :tangle "lisp/init-windows.el" :mkdirp yes
(use-package winner
  :ensure nil
  :hook (elpaca-after-init . winner-mode)
  :bind
  (("<leader> wu" . winner-undo)
   ("<leader> wr" . winner-redo)))
#+end_src

Spacious padding add a pad 🤯 in the emacs frame and between windows.
Add a more aesthetic look.
#+begin_src emacs-lisp :tangle "lisp/init-windows.el" :mkdirp yes
(use-package spacious-padding
  :ensure t
  :if (display-graphic-p)
  :bind
  (("<leader> ts" . spacious-padding-mode))
  :init
  (setq spacious-padding-widths
        '( :internal-border-width 30
           :header-line-width 4
           :mode-line-width 6
           :tab-width 4
           :right-divider-width 30
           :scroll-bar-width 8
           :left-fringe-width 20
           :right-fringe-width 20))

  (setq spacious-padding-subtle-mode-line
        '( :mode-line-active spacious-padding-subtle-mode-line-active
           :mode-line-inactive spacious-padding-subtle-mode-line-inactive)))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-windows.el" :mkdirp yes
(provide 'init-windows)
;;; lisp/init-windows.el ends here
#+end_src

