README.org
** Configure Dired (the best file manager) 
#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
;;; init-dired.el -*- lexical-binding: t; -*-
#+end_src

Dired is a builtin package, a brief description of the configuration variables:
- ~dired-recursive-copies~, ~dired-recursive-deletes~ setted to ~t~ so emacs don't ask for on recursive function
- ~delete-by-moving-to-trash~ instead of /rm/ files, move them to /trash/ directory
- ~dired-mouse-drag-files~, ~dired-make-directory-clickable~ enable mouse action in dired
- ~dired-dwim-target~, so dired try to guess target direction for some actions (i.e. copy or moving) when there are 2 dired windows
#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
(use-package dired
  :ensure nil
  :commands (dired)
  :custom 
  (dired-listing-switches "-aghl -v --group-directories-first")
  :hook
  ((dired-mode . hl-line-mode))
  :config
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq delete-by-moving-to-trash t)
  (setq dired-mouse-drag-files t)
  (setq dired-make-directory-clickable t)
  (setq dired-dwim-target t))
#+end_src

Enable opening directory in dired in /tree/ manner.
#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  (:map dired-mode-map
        ("<tab>" . dired-subtree-toggle)
        ("TAB" . dired-subtree-toggle)
	("SPC" . nil)
        ("<backtab>" . dired-subtree-remove)
        ("S-TAB" . dired-subtree-remove))
  :config
  (setq dired-subtree-use-backgrounds nil))
#+end_src

Toggle show dotfiles in dired, binded to ~(kbd "C-h")~ like in other file manager like /nautilus/.
#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
(use-package dired-hide-dotfiles;
  :ensure t
  :after (dired evil-collection)
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :bind
  (:map dired-mode-map
        ("C-h" . dired-hide-dotfiles-mode)))
#+end_src

Add trashed mode to easily manage the /Trash/ directory.
#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
(use-package trashed
  :ensure t
  :commands (trashed)
  :config
  (setq trashed-action-confirmer 'y-or-n-p)
  (setq trashed-use-header-line t)
  (setq trashed-sort-key '("Date deleted" . t))
  (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-dired.el" :mkdirp yes
(provide 'init-dired)
;;; init-dired.el ends here
#+end_src

** Configure completion (minibuffer, capf, etc...)
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
;;; init-completion.el -*- lexical-binding: t; -*-
#+end_src

Enable ~which-key~, always usefult to learn new shortcuts and strengthen the ones I alread know.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package which-key
  :ensure t
  :config
  (setq which-key-show-early-on-C-h t)
  (setq which-key-idle-delay 0.01)
  (setq which-key-idle-secondary-delay 0.01)
  :init
  (which-key-mode))
#+end_src

I prefer ~vertico~ because it's better integrated with builtin functionality, I also enable ~vertico-mouse~ so I can use the mouse in minibuffer.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package vertico
  :ensure t
  :custom
  (vertico-cycle t)
  (vertico-count 12)
  :hook (elpaca-after-init . vertico-mode))

(use-package vertico-mouse
  :ensure nil
  :after vertico
  :hook (vertico-mode . vertico-mouse-mode))
#+end_src

~Marginalia~ add annotations in the minibuffer, I can cycle between annotations strategy with ~(kbd "M-A")~.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package marginalia
  :ensure t
  :hook (elpaca-after-init . marginalia-mode)
  :bind
  (:map minibuffer-local-map
	("M-A" . marginalia-cycle)))
#+end_src

~Orderless~ allow for extremely powerful (in combo with the previous listed packages) text matching in the minibufffer.
TODO: learn how to switch on the fly between differents /matching/ styles.

#+begin_src emacs-lisp :tangle "lisp/init-completion.el"  :mkdirp yes
(defun nto/match-components-literally ()
  "Components match literally for the rest of the session."
  (interactive)
  (setq-local orderless-matching-styles '(orderless-literal)
              orderless-style-dispatchers nil))

(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic))
  (setq completion-category-defaults nil)
  (setq completion-category-overrride nil))
#+end_src

Enable ~savehist~ and ~recentf~, so the completion are based on recent file and previous searches.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el"  :mkdirp yes
(use-package savehist
  :ensure nil
  :hook (elpaca-after-init . savehist-mode)
  :config
  (add-to-list 'savehist-additional-variables 'corfu-history))

(use-package recentf
  :ensure nil
  :hook (elpaca-after-init . recentf-mode))
#+end_src

~Corfu~ enable completion at point (capf) in emacs, like in other editors like vscode.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el"  :mkdirp yes
(use-package corfu
  :ensure t
  :hook (elpaca-after-init . global-corfu-mode)
  :custom
  (corfu-auto t)
  :bind
  (:map corfu-map
        ("<tab>" . corfu-complete)
        ("C-n" . corfu-next)
        ("C-p" . corfu-previous)
        ("C-M-SPC" . corfu-insert-separator)
        ("C-q" . corfu-quick-complete))
  :config
  (setq corfu-cycle t)
  (setq tab-always-indent 'complete)
  (setq corfu-preview-current nil)
  (setq corfu-min-width 20)
  (setq corfu-popupinfo-delay '(1.25 . 0.5))
  (corfu-popupinfo-mode 1) ; shows documentation after `corfu-popupinfo-delay'
  (corfu-history-mode 1)
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history)))

#+end_src

~Cape~ enhance the completion at point capabilities of emacs, integrate well with ~corfu~.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package cape
  :ensure t
  :bind
  (("C-c p" . cape-prefix-map)
   ("M-c f" . cape-file)
   ("M-c D" . cape-dabbrev)
   ("M-c d" . cape-dict)
   ("M-c h" . cape-history)
   ("M-c k" . cape-keyword)
   ("M-c l" . cape-line))
  :init
  (add-hook 'completion-at-point-functions #'cape-dabbrev)
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-elisp-block))
#+end_src

~Consult~ gives me a set of commands to replace some builtin and also provide some pretty useful extra commmands.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package consult
  :ensure t
  :after evil
  :bind
  (([remap Info-search] . consult-info)
   ("M-y" . consult-yank-pop)
   ("<leader> ht" . consult-theme)

   ("<leader> jc" . consult-line)
   ("<leader> jC" . consult-goto-line)

   ("<leader> fg" . consult-ripgrep)
   ("<leader> /" . consult-ripgrep)
   ("<leader> fh" . consult-mode-command)
   ("<leader> ff" . consult-find)
   ("<leader> fl" . consult-locate)

   ("<leader> ce" . consult-compile-error)

   ("<leader> bc" . consult-bookmark)

   ("<leader> bb" . consult-buffer)
   ("<leader> bB" . consult-buffer-other-window)
   ("<leader> b C-B" . consult-buffer-other-tab)
   ("<leader> b M-B" . consult-buffer-other-frame)

   :map minibuffer-local-map
   ("M-s" . consult-history)
   ("M-r" . consult-history)))
#+end_src

~Embark~ is a great package that provide some contextual action, like a right click menu, all controlled by the keyboard obviously.
Also add ~embark~ and ~consult~ integration.
#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(use-package embark
  :ensure t
  :bind
  (("C-." . embark-act)
   ("M-." . embark-dwim)
   ("<leader> hB" . embark-bindings))
  :init
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  (add-to-list 'display-buffer-alist
	       '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		 nil
		 (window-parameters (mode-line-format . none)))))

(use-package embark-consult
  :ensure t
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-completion.el" :mkdirp yes
(provide 'init-completion)
;;; init-completion.el ends here
#+end_src

