README.org
** Make emacs more evil
Setup /evil-mode/ and related package to enable a proper modal editing.

Use ~undo-tree~ as undo mechanism, I don't bind any special key for the undo visualization tree, the builtin are fine.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package undo-tree
  :ensure t
  :custom
  (undo-tree-history-directory-alist `(("." . ,(expand-file-name "undo-tree-hist/" nto-cache))))
  :init
  (global-undo-tree-mode))
#+end_src

Install ~evil-mode~, setup *leader* and *localleader* keys, also bind a gazillion bindings.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil
  :ensure t
  :after undo-tree
  :hook (elpaca-after-init . evil-mode)
  :custom
  (evil-undo-system 'undo-tree)
  :config
  (setq evil-want-C-i-jump nil)
  (setq evil-want-C-u-delete nil)
  (setq evil-want-C-u-scroll nil)
  (setq evil-want-C-d-scroll nil)
  (setq evil-want-Y-yank-to-eol t)
  (setq evil-disable-insert-state-bindings t)
  (setq evil-split-window-below t)
  (setq evil-split-window-right t)
  (setq evil-want-fine-undo t)
  (setq evil-kill-on-visual-paste nil)

  (evil-set-initial-state 'calc-mode 'emacs)

  (define-key evil-insert-state-map (kbd "C-n") nil)
  (define-key evil-insert-state-map (kbd "C-p") nil)
  (define-key evil-insert-state-map (kbd "C-q") nil)
  (define-key evil-normal-state-map (kbd "C-.") nil)
  (define-key evil-normal-state-map (kbd "M-.") nil)

  (evil-set-leader 'normal (kbd "SPC") nil)
  (evil-set-leader 'visual (kbd "SPC") nil)
  (evil-set-leader 'operator (kbd "SPC") nil)
  (evil-set-leader 'replace (kbd "SPC") nil)
  (evil-set-leader 'motion (kbd "SPC") nil)
  (evil-set-leader 'insert (kbd "M-SPC") nil)
  (evil-set-leader 'emacs (kbd "C-c c") nil)

  (evil-set-leader 'normal (kbd "<leader> m") t)
  (evil-set-leader 'visual (kbd "<leader> m") t)
  (evil-set-leader 'operator (kbd "<leader> m") t)
  (evil-set-leader 'replace (kbd "<leader> m") t)
  (evil-set-leader 'motion (kbd "<leader> m") t)
  (evil-set-leader 'insert (kbd "<leader> m") t)

  (evil-define-key 'normal dired-mode-map
    (kbd "h") #'dired-up-directory
    (kbd "l") #'dired-find-file)

  (evil-define-key '(normal visual operator replace motion) 'global
    (kbd "gr") #'revert-buffer)

  (evil-define-key nil 'global
    (kbd "<leader> hk") #'describe-key
    (kbd "<leader> hv") #'describe-variable
    (kbd "<leader> hf") #'describe-function
    (kbd "<leader> hc") #'describe-command
    (kbd "<leader> hm") #'describe-keymap

    (kbd "<leader> .") #'find-file
    (kbd "<leader> fs") #'save-buffer
    (kbd "<leader> fd") #'dired 
    (kbd "<leader> fr") #'recentf 

    (kbd "<leader> bk") #'kill-this-buffer
    (kbd "<leader> br") #'revert-buffer

    (kbd "<leader> bm") #'bookmark-set
    (kbd "<leader> bd") #'bookmark-delete

    (kbd "<leader> SPC") #'execute-extended-command
    (kbd "<leader> C-SPC") #'execute-extended-command-for-buffer

    (kbd "<leader> tl") #'display-line-numbers-mode

    (kbd "<leader> ws") #'evil-window-split
    (kbd "<leader> wv") #'evil-window-vsplit
    (kbd "<leader> wc") #'evil-window-delete
    (kbd "<leader> wh") #'evil-window-left
    (kbd "<leader> wM") #'toggle-frame-maximized
    (kbd "<leader> wj") #'evil-window-down
    (kbd "<leader> wk") #'evil-window-up
    (kbd "<leader> wl") #'evil-window-right
    (kbd "<leader> w1") #'delete-other-windows
    (kbd "<leader> wm") #'delete-other-windows
    (kbd "<leader> w0") #'delete-window
    (kbd "<leader> wo") #'other-window)

  (evil-define-key nil 'global
    (kbd "C-a") #'beginning-of-line
    (kbd "C-e") #'end-of-line
    (kbd "C-f") #'forward-char
    (kbd "C-b") #'backward-char
    (kbd "C-p") #'previous-line
    (kbd "C-n") #'next-line
    (kbd "C-d") #'delete-char))
#+end_src

Install ~evil-collection~ to have a good /evil/ baseline in most modes and applications.
Before enable the package I blacklist some keys so they want be used by ~evil-collection~.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-collection
  :ensure t
  :after evil
  :init
  (evil-collection-init))

(with-eval-after-load 'evil-collection
  (setq evil-collection-key-blacklist
        (append '("SPC" "C-SPC" "SPC m" "C-SPC m")
                evil-collection-key-blacklist
		'("gd" "gf" "K")
                '("gr" "gR")
                '("[" "]" "gz"))))
#+end_src

The ~evil-escape~ let me go back to normal mode with a rapid combination of keys (in my case /jk/) instead of reaching for ~(kbd "<escape>")~.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-escape
  :ensure t
  :after evil
  :hook (evil-mode . evil-escape-mode)
  :config
  (setq-default evil-escape-key-sequence "jk")
  (setq-default evil-escape-delay 0.2))
#+end_src

*** Evil textobject magic
The following are a series of /evil-mode/ extension that allow for some peculiar text action. 

**** Evil exchange
Let me exchange two region by simply selecting them and mark for /exchange/ with ~(kbd "gx")~.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-exchange
  :ensure t
  :after evil
  :commands evil-exchange
  :init
  (evil-exchange-install))
#+end_src

**** Evil Lion 
Let me align the textobjects on the left, or the right, of a specific delimiter:
  #+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-lion
  :ensure t
  :after evil
  :config
  (evil-lion-mode))
#+end_src

+ ~(kbd "gl")~, align on left
+ ~(kbd "gL")~, align on right

**** Evil Surrond
Surround textobject with custom delimiters:
  #+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-surround
  :ensure t
  :after evil
  :config
  (global-evil-surround-mode 1))
#+end_src
pHere some examples take from the package docs:p
| bindins               | input              | result              | Note                               |
|-----------------------+--------------------+---------------------+------------------------------------|
| cs"'                  | "Hello World"      | 'Hello World'       | change inside textobjects          |
| cs'<q>                | 'Hello World'      | <q>Hello World</q>  |                                    |
| cst"                  | <q>Hello World</q> | "Hello World"       |                                    |
| <region>S(            | a-lisp-function    | (a-lisp-function)   | work on regions                    |
| <region>s(            | a-lisp-function    | ( a-lisp-function ) | diff between s and S               |
| ds"                   | "Hello World"      | Hello World         | delete surrounding                 |
| ysiw]  (cursor on ⬇️) | He⬇llo World       | [Hello] World       | combinate with another textobjects |
| ysiw{  (cursor on ⬇️) | He⬇llo World       | { Hello } World     | diff between (), [], {}            |

**** Evil Snipe
Evil already have a snipe bounded to ~(kbd "f")~ but this package by [[https:github.com/hlissner/evil-snipe][hlissner]] enhance the defualt behaviour with repeateable movements and also other kinds of snipes.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-snipe
  :ensure t
  :after evil
  :commands evil-snipe-local-mode evil-snipe-override-local-mode
  :hook (evil-mode . evil-snipe-override-mode)
  :hook (evil-mode . evil-snipe-mode)
  :init
  (setq evil-snipe-smart-case t
        evil-snipe-scope 'line
        evil-snipe-repeat-scope 'visible
        evil-snipe-char-fold t))
#+end_src

**** Evil Visualstar 
Enhance the navigation between same symbols with ~(kbd "#")~  and  ~(kbd "*")~.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-visualstar
  :ensure t
  :after evil
  :hook (evil-mode . global-evil-visualstar-mode)
  :config
  (setq-default evil-visualstart/persistent t))
#+end_src

**** Exato
Add textobject for /xml-like/ formats.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package exato
  :ensure t
  :after evil)
#+end_src

**** Evil Nerd Commenter
Add movement to comment/decomment region or textobjects.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-nerd-commenter
  :ensure t
  :after evil
  :init
  (evil-define-key '(visual normal) 'global "gc" #'evilnc-comment-operator))
#+end_src

**** Evil Textobj Anyblock 
Add textobjects for block/body, bind to ~(kbd "b")~.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-textobj-anyblock
  :ensure t
  :after evil
  :init
  (define-key evil-inner-text-objects-map "b" 'evil-textobj-anyblock-inner-block)
  (define-key evil-outer-text-objects-map "b" 'evil-textobj-anyblock-a-block))
#+end_src

