README.org
**** Evil Multiedit
Add multiple cursor to emacs, despite the name doesn't require /evil-mode/ to work.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-multiedit
  :ensure t
  :after evil
  :config
  (evil-define-key 'normal 'global
    (kbd "M-a")   #'evil-multiedit-match-symbol-and-next
    (kbd "M-A")   #'evil-multiedit-match-symbol-and-prev)
  (evil-define-key 'visual 'global
    "R"           #'evil-multiedit-match-all
    (kbd "M-a")   #'evil-multiedit-match-and-next
    (kbd "M-A")   #'evil-multiedit-match-and-prev)
  (evil-define-key '(visual normal) 'global
    (kbd "C-M-a") #'evil-multiedit-restore)

  (with-eval-after-load 'evil-mutliedit
    (evil-define-key 'multiedit 'global
      (kbd "M-a")   #'evil-multiedit-match-and-next
      (kbd "M-S-a") #'evil-multiedit-match-and-prev
      (kbd "RET")   #'evil-multiedit-toggle-or-restrict-region)
    (evil-define-key '(multiedit multiedit-insert) 'global
      (kbd "C-n")   #'evil-multiedit-next
      (kbd "C-p")   #'evil-multiedit-prev)))
#+end_src

**** Evil Goggles 
Add visual helpers on /evil-mode/ actions.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-goggles
  :ensure t
  :config
  (evil-goggles-mode)
  (evil-goggles-use-diff-faces))
#+end_src

**** Evil Traces
Similar to /evil-goggles/ but for /iedit/ action, the one accessed by ":command" to be clear.
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(use-package evil-traces
  :ensure t
  :config
  (evil-traces-use-diff-faces) 
  (evil-traces-mode))
#+end_src

*** Evil End Here 
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
(provide 'init-evil)
;;; init-evil.el ends here
#+end_src

** Jumps
Config about specific packages that let me move from a point to another with a single shortcut.
#+begin_src emacs-lisp :tangle "lisp/init-jumps.el" :mkdirp yes
;;; init-jumps.el -*- lexical-binding: t; -*-
#+end_src

Ace-Window let me jump from a window to another visible one with a single key, also allow to perform some actions on the layout on the fly.
#+begin_src emacs-lisp :tangle "lisp/init-jumps.el" :mkdirp yes
(use-package ace-window
  :ensure t
  :after evil
  :bind
  (("<leader> ww" . ace-window)
   ("<leader> wS" . ace-swap-window)
   ("<leader> w C-w" . ace-swap-window)
   ("<leader> wx" . ace-delete-window))
  :config
  (setq aw-background nil)
  (setq aw-dispatch-always t)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (defvar aw-dispatch-alist
    '((?x aw-delete-window "Delete Window")
      (?m aw-swap-window "Swap Windows")
      (?M aw-move-window "Move Window")
      (?c aw-copy-window "Copy Window")
      (?j aw-switch-buffer-in-window "Select Buffer")
      (?n aw-flip-window)
      (?u aw-switch-buffer-other-window "Switch Buffer Other Window")
      (?c aw-split-window-fair "Split Fair Window")
      (?v aw-split-window-vert "Split Vert Window")
      (?b aw-split-window-horz "Split Horz Window")
      (?o delete-other-windows "Delete Other Windows")
      (?? aw-show-dispatch-help))
    "List of actions for `aw-dispatch-default'."))
#+end_src

Avy jump is similar to Ace-Window but works on characters, words and line.
#+begin_src emacs-lisp :tangle "lisp/init-jumps.el" :mkdirp yes
(use-package avy
  :ensure t
  :after evil
  :bind
  (("<leader> jj" . avy-goto-char-timer)
   ("<leader> jl" . avy-goto-line)
   ("<leader> je" . avy-goto-end-of-line)
   ("<leader> jw" . avy-goto-word-0)))
#+end_src

A minimap for emacs, don't let me perform select piece of the buffer from the minimap preview, maybe need some extra configuration.
I don't use it very much.
#+begin_src emacs-lisp :tangle "lisp/init-jumps.el" :mkdirp yes
(use-package demap
  :ensure (:host gitlab :repo "sawyerjgardner/demap.el")
  :commands (demap-toggle)
  :config
  (setq demap-minimap-window-side 'right)
  (setq demap-minimap-window-width 20)
  (setq demap-minimap-window-width 20)
  :bind
  (("<leader> tm" . demap-toggle)))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-jumps.el" :mkdirp yes
(provide 'init-jumps)
;;; init-jumps.el ends here
#+end_src

** Setup Org Mode
One of the killer feature of emacs, alongside dired and magit for me.
#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
;;; init-org.el -*- lexical-binding: t; -*-
#+end_src

Org is a builtin package, unfortunately it binds way to many keys for.
#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
(use-package org
  :ensure nil
  :hook
  (org-mode . variable-pitch-mode)
  :bind
  (("C-c a" . org-agenda)
   ("<leader> oa" . org-agenda)
   :map org-mode-map
   ("C-'" . nil)
   ("C-," . nil)
   ("M-;" . nil)
   ("M-l" . nil)
   ("C-c ;" . nil)
   ("<localleader> c" . org-toggle-checkbox)
   ("<localleader> di" . org-time-stamp)
   ("<localleader> ds" . org-schedule)
   ("<localleader> dd" . org-deadline)
   ("<localleader> t" . org-todo)
   ("<localleader> f" . org-footnote-new))
  :init 
  (setq org-directory (expand-file-name "~/Documents/Org"))
  (setq org-agenda-files `(,(expand-file-name "Agenda.org" org-directory)))

  (setq org-agenda-custom-commands
        `(
          ("d" "Daily Agenda"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-deadline-warning-days 7)
                     (org-agenda-format-date "%A %-e %B %Y")
                     (org-agenda-overriding-header "Today 📆")))
            (todo "WAIT"
                  ((org-agenda-overriding-header "Waiting tasks 🕙")))))

          ("r" "Reading List"
           ((tags "reading"
                  ((org-agenda-overriding-header "Currently reading 📖")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'regexp "^\\* Reading list .*"))))
            (tags "+book-reading"
                  ((org-agenda-overriding-header "Next to read 📚")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'regexp "^\\* Reading list .*"))))))

          ("g" "Getting Things Done"
           ((tags "inbox"
                  ((org-agenda-overriding-header "Inbox: 📬")))
            (alltodo "TODO"
                  ((org-agenda-overriding-header "Act: 📌")))
            (tags "Explore"
                  ((org-agenda-overriding-header "Explore: 🔭")))))

          ("p" "Projects"
           ((tags "proj"
                  ((org-agenda-overriding-header "Projects: 🛠️")
                   (org-agenda-skip-if 'done)))
            (tags "proj"
                  ((org-agenda-overriding-header "Completed: ⚒️✅️")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo 'done))))))

          ("u" "Uni"
           ((tags "+uni-exam"
                  ((org-agenda-overriding-header "Uni: 🎓")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'regexp "^\\* Uni .*"))))
            (tags "exam"
                  ((org-agenda-overriding-header "Exams todo: 📄")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo '("PROGRESS")))))
            (tags "exam"
                  ((org-agenda-overriding-header "Current courses: 🏢")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo '("TODO")))))
            (tags "exam"
                  ((org-agenda-overriding-header "Remaining exams: 📆")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo '("WAIT")))))
            (tags "+uni+proj"
                  ((org-agenda-overriding-header "Projects: 💻")))
            (tags "exam done"
                  ((org-agenda-overriding-header "Exams Completed: 📄✅")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo 'done))))))))

  :config
  (add-hook 'org-mode-hook
	    (lambda ()
	      (setq-local electric-pair-inhibit-predicate
			  `(lambda (c)
			     (if (char-equal c ?<) t
			       (,electric-pair-inhibit-predicate c))))))

  (setq org-todo-keywords
        '((sequence "TODO(t)" "WAIT(w!)" "PROGRES(p!)" "|" "CANCEL(c!)" "DONE(d!)")))

  (evil-set-initial-state 'org-agenda-mode 'normal)
  (evil-define-key 'normal org-agenda-mode-map
    (kbd "q") #'org-agenda-quit
    (kbd "Q") #'org-agenda-Quit
    (kbd "RET") #'org-agenda-goto)

  (setq org-agenda-span 'week)
  (setq org-agenda-start-on-weekday 1)
  (setq org-agenda-window-setup 'current-window)

  (setq org-M-RET-may-split-line '((default . nil)))
  (setq org-insert-heading-respect-content t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-ellipsis "⮧")
  (setq org-adapt-indentation nil)
  (setq org-special-ctrl-a/e nil)
  (setq org-special-ctrl-k nil)
  (setq org-confirm-babel-evaluate nil)
  (setq org-src-window-setup 'current-window)
  (setq org-edit-src-persistent-message nil)
  (setq org-src-fontify-natively t)
  (setq org-src-preserve-indentation t)
  (setq org-src-tab-acts-natively t)
  (setq org-hide-emphasis-markers t)
  (setq org-edit-src-content-indentation 0)
  (setq org-export-with-toc t)
  (setq org-cycle-emulate-tab t)
  (setq org-export-headline-levels 8))
#+end_src

Enhance the Org UI with /org-modern/.
#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
(use-package org-modern
  :ensure t
  :after org
  :custom
  (org-modern-table nil)
  (org-modern-star nil)
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda)))
#+end_src

Org appear change the visibility of emphasis marker at cursor.
#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
(use-package org-appear
  :ensure t
  :hook
  (org-mode . org-appear-mode))
#+end_src

Org fragtog enable inline display of latex formulas.
#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
(use-package org-fragtog
  :ensure t
  :after org
  :custom
  (org-startup-with-latex-preview t)
  :hook
  (org-mode . org-fragtog-mode)
  :custom
  (org-format-latex-options
   (plist-put org-format-latex-options :scale 2)
   (plist-put org-format-latex-options :foreground 'auto)
   (plist-put org-format-latex-options :background 'auto)))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
(provide 'init-org)
;;; init-org.el ends here
#+end_src

*** GTD workflow 
No specific keybinding or complicated function or file structure to implement it, just my ~Agenda.org~ file and a bunch of /tags/.

1. ~Inbox~, capture and dump idea, tag them with the ~:inbox:~ tag
2. ~Act~, decide what to do with the ~inbox~ entries, either:
   + ~Discard~, just delete 
   + ~Schedule~, either put a /deadline/, /schedule/ or just a /todo/
3. ~Store~, if I don't want to act store somewhere for future uses

