README.org
** Setup Denote for note taking
I use denote in combination with /org-mode/ (and sometimes /markdown/ and /txt/) to store and link my notes.
#+begin_src emacs-lisp :tangle "lisp/init-notes.el" :mkdirp yes
;;; init-notes.el -*- lexical-binding: t; -*-

(use-package denote
  :ensure t
  :hook
  ((text-mode . denote-fontify-links-mode-maybe)
   (dired-mode . denote-dired-mode)
   (markdown-mode . denote-dired-mode))
  :config
  (setq denote-directory "~/Documents/Org/notes")
  (setq denote-known-keywords '("emacs" "programming" "algorithm"
				"datastructure" "cryptography" "logbook"
                                "film" "book" "meta"
                                "linux" "windows" "fitness"))
  (setq denote-infer-keywords t)
  (setq denote-sort-keywords t)
  :bind
  (("<leader> nn" . denote)
   ("<leader> nf" . denote-open-or-create)
   ("<leader> nN" . denote-type)
   ("<leader> nr" . denote-rename-file)
   ("<leader> nR" . denote-rename-file-using-front-matter)
   ("<leader> ni" . denote-link)
   ("<leader> nh" . denote-org-extras-link-to-heading)
   ("<leader> nI" . denote-add-links)
   ("<leader> nb" . denote-backlinks)
   ("<leader> nB" . denote-org-extras-backlinks-for-heading)

   ("<leader> nsn" . denote-sequence)
   ("<leader> nsf" . denote-sequence-dired)
   ("<leader> nsi" . denote-sequence-link)
   ("<leader> nsc" . denote-sequence-new-child-of-current)
   ("<leader> nsr" . denote-sequence-reparent)
   ("<leader> nss" . denote-sequence-new-sibling-of-current)))

(use-package consult-denote
  :ensure t
  :bind
  (("<leader> nF" . consult-denote-find)
   ("<leader> ng" . consult-denote-grep))
  :config
  (consult-denote-mode 1))

(provide 'init-notes)
;;; init-notes.el ends here
#+end_src

** Enhance Emacs UI 
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
;;; init-ui.el -*- lexical-binding: t; -*-
#+end_src

Icons for Emacs:
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package nerd-icons
  :ensure t)

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons-corfu
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

Breadcrumb, show a trace on the top of the buffer about context information, variable, inside the function, etc...
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package breadcrumb
  :ensure t
  :bind (("<leader> tb" . breadcrumb-local-mode)))
#+end_src

Rainbow mode change the face of /colors strings/ (like #ff00ff) to the color they represent.
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package rainbow-mode
  :ensure t
  :commands (rainbow-mode)
  :hook (prog-mode . rainbow-mode))
#+end_src

Rainbow delimiters use a different face for each nested parentheses, really useful on lisp languages.
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

Pulsar highlight the line where the cursor is when it is invoked.
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package pulsar
  :ensure t
  :config
  (setopt pulsar-pulse t
          pulsar-delay 0.055
          pulsar-iterations 10
          pulsar-face 'pulsar-green
          pulsar-highlight-face 'pulsar-magenta)
  (pulsar-global-mode 1))
#+end_src

Doom modeline give a nice and moder modeline UI. 
#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(use-package doom-modeline
  :ensure t
  :hook (elpaca-after-init . doom-modeline-mode)
  :hook (doom-modeline-mode . size-indication-mode)
  :hook (doom-modeline-mode . column-number-mode)
  :config
  (setq doom-modeline-lsp-icon nil))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(provide 'init-ui)
;;; init-ui.el ends here
#+end_src

** Project related setup
Mainly setup *magit* and *project*.
#+begin_src emacs-lisp :tangle "lisp/init-proj.el" :mkdirp yes
;;; init-proj.el -*- lexical-binding: t; -*-

(use-package project
  :ensure nil
  :bind
  (("<leader> pp" . project-switch-project)
   ("<leader> pb" . project-switch-buffer)
   ("<leader> pc" . project-compile)
   ("<leader> ps" . project-shell)
   ("<leader> pe" . project-eshell)
   ("<leader> pf" . project-find-file)
   ("<leader> pk" . project-kill-buffers)
   ("<leader> p&" . project-async-shell-command)))

(use-package transient
  :ensure t
  :defer t
  :config
  (setq transient-show-popup 0.2))

(use-package magit
  :ensure t
  :bind
  (("<leader> gg" . magit-status)))

(use-package diff-hl
  :ensure t
  :hook (elpaca-after-init . global-diff-hl-mode)
  :config
  (setq diff-hl-global-modes '(not image-mode pdf-view-mode))
  (setq vc-git-diff-switches '("--histogram"))
  (setq diff-hl-flydiff-delay 0.5)
  (setq diff-hl-update-async t)
  (setq diff-hl-show-staged-changes nil))

(provide 'init-proj)
;;; init-proj.el ends here
#+end_src

** Text goodies
Just packages that makes my life easier working with text, they are not specific to /evil-mode/.
#+begin_src emacs-lisp :tangle "lisp/init-proj.el" :mkdirp yes
;;; init-text-goodies.el -*- lexical-binding: t; -*-
#+end_src

Rotate text let me cycle between some common word patterns, i.e. true/false, top/bottom/left/right, etc...
#+begin_src emacs-lisp :tangle "lisp/init-text-goodies.el" :mkdirp yes
(use-package rotate-text
  :ensure (:host github :repo "debug-ito/rotate-text.el")
  :after evil
  :config
  (evil-define-key 'normal 'global
    (kbd "]r") #'rotate-text
    (kbd "[r") #'rotate-text-backward))
#+end_src

Self explainatory, my english sucks.
#+begin_src emacs-lisp :tangle "lisp/init-text-goodies.el" :mkdirp yes
(use-package google-translate
  :ensure t
  :custom
  (google-translate-translation-directions-alist
        '(("it" . "en") ("en" . "it")))
  (google-translate-default-source-language "it")
  (google-translate-default-target-language "en")
  :bind
  (("<leader> lp" . google-translate-at-point)
   ("<leader> lP" . google-translate-at-point-reverse))
  :init
  (add-to-list 'display-buffer-alist
	       '("\\*Google Translate\\*"
		 (display-buffer-reuse-window
		  display-buffer-below-selected)
		 (dedicated . t)
		 (window-height . fit-window-to-buffer)
		 (body-function . (lambda (window) (select-window window))))))
#+end_src

To edit markdown files (see also the /notes/ section).
#+begin_src emacs-lisp :tangle "lisp/init-text-goodies.el" :mkdirp yes
(use-package markdown-mode
  :ensure t
  :defer t
  :config
  (setq markdown-fontify-code-blocks-natively t))
#+end_src

Move line of region of text.
#+begin_src emacs-lisp :tangle "lisp/init-text-goodies.el" :mkdirp yes
(use-package drag-stuff
  :ensure t
  :bind
  (("M-j" . drag-stuff-down)
   ("M-k" . drag-stuff-up))
  :init
  (drag-stuff-global-mode 1))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-text-goodies.el" :mkdirp yes
(provide 'init-text-goodies)
;;; init-text-goodies.el ends here
#+end_src

** Snippet
As snippets system I'm trying ~tempel~, so far so good, but I need to study a bit how to build my own snippets.
#+begin_src emacs-lisp :tangle "lisp/init-snippets.el" :mkdirp yes
;;; init-snippets.el -*- lexical-binding: t; -*-

(use-package tempel
  :ensure t
  :custom
  (tempel-trigger-prefix "<")
  :init
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-complete
                      completion-at-point-functions)))
  (add-hook 'conf-mode-hook 'tempel-setup-capf)
  (add-hook 'prog-mode-hook 'tempel-setup-capf)
  (add-hook 'text-mode-hook 'tempel-setup-capf)
  (add-hook 'org-mode-hook 'tempel-setup-capf))

(use-package tempel-collection
  :ensure t)

(provide 'init-snippets)
;;; init-snippets.el ends here
#+end_src

** Installing Themes 
Nothing to say, just a bunch of themes.
#+begin_src emacs-lisp :tangle "lisp/init-themes.el" :mkdirp yes
;;; init-themes.el -*- lexical-binding: t; -*-

(use-package doom-themes
  :ensure t)

(use-package ef-themes
  :ensure t)

(use-package tron-legacy-theme
  :ensure t)

(use-package spacemacs-theme
  :ensure t)

(use-package anti-zenburn-theme
  :ensure t)

(use-package gruber-darker-theme
  :ensure t)

(provide 'init-themes)
;;; init-themes.el ends here
#+end_src

