README.org
** Setup fonts
Setup font, both for monospaced and proportionally spaced font, [[https://www.youtube.com/watch?v=qR8JRYr4BKE&list=PL8Bwba5vnQK3sQdwAbtdvuxUdtKSfOftA&index=8][Prot]] has a good video on the topic.
My code is almost the same from the video.
#+begin_src emacs-lisp :tangle "lisp/init-fonts.el" :mkdirp yes
;;; init-fonts.el -*- lexical-binding: t; -*-

(let ((mono-spaced-font "Aporetic Serif Mono") ;; "Monospace" backup
      (proportionately-spaced-font "Aporetic Sans")) ;; "Sans" backup

  (set-face-attribute
   'default nil
   :family mono-spaced-font
   :height 120)

  (set-face-attribute
   'fixed-pitch nil
   :family mono-spaced-font
   :height 1.0)

  (set-face-attribute
   'variable-pitch nil
   :family proportionately-spaced-font
   :height 1.0))

(use-package ligature
  :ensure t
  :hook (prog-mode . ligature-mode)
  :config
  (ligature-set-ligatures 't '("www"))
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://")))

(provide 'init-fonts)
;;; init-fonts.el ends here
#+end_src

** Setup strokes
Strokes are what other platform calls mouse/touchpad gesture.
To create a stroke I need to call ~strokes-global-set-stroke~, and after perform the gesture I need a command to bind it, this section contains all the commands specific to strokes actions.
This section is in *testing* and may be deleted in the future.
#+begin_src emacs-lisp :tangle "lisp/init-strokes.el" :mkdirp yes
;;; init-strokes.el -*- lexical-binding: t; -*-

;; set of function to bind to custom `strokes'
(defun nto/jump-to-code ()
  (interactive)
  (dired "~/Code"))

(provide 'init-strokes)
;;; init-strokes.el ends here
#+end_src

** Setup Application
This section is all about packages that gives me a functionality.
#+begin_src emacs-lisp :tangle "lisp/init-applications.el" :mkdirp yes
;;; init-applications.el -*- lexical-binding: t; -*-

#+end_src
*** XDG app menu
Just an app launcher inside emacs, although it is useful sometimes I disable it.
Maybe can will be better integrated with a tiling window manager, for now I don't need it.
#+begin_src emacs-lisp 
(use-package xdg-appmenu
  :ensure (:host codeberg :repo "akib/emacs-xdg-appmenu")
  :bind
  (("C-<f2>" . xdg-appmenu)))
#+end_src

*** Distraction free writing
Darkroom make up for a pleasing writing environment.
#+begin_src emacs-lisp :tangle "lisp/init-applications.el" :mkdirp yes
(use-package darkroom
  :ensure t
  :bind
  (("<leader> tw" . darkroom-tentative-mode)))
#+end_src

*** RSS reader
Elfeed is an rss reader for emacs, I prefer to configure it with Org mode.
#+begin_src emacs-lisp :tangle "lisp/init-applications.el" :mkdirp yes
(use-package elfeed
  :ensure t
  :custom
  (elfeed-db-directory (expand-file-name "elfeed" nto-cache))
  (elfeed-show-entry-switch 'display-buffer)
  :bind
  ("<leader> of" . elfeed))

(use-package elfeed-org
  :ensure t
  :config
  (elfeed-org)
  :custom
  (rmh-elfeed-org-files (list (expand-file-name "elfeed.org" org-directory))))

(use-package elfeed-goodies
  :ensure t
  :config
  (elfeed-goodies/setup))
#+end_src

*** Application Ends Here
#+begin_src emacs-lisp :tangle "lisp/init-applications.el" :mkdirp yes
(provide 'init-applications)
;;; init-applications.el ends here
#+end_src

** Setup shells
Eshell is builtin.
#+begin_src emacs-lisp :tangle "lisp/init-eshell.el" :mkdirp yes
;;; init-eshell.el -*- lexical-binding: t; -*-
(use-package eshell
  :ensure nil
  :config 
  (setq eshell-directory-name (expand-file-name "eshell" user-emacs-directory))
  (setq eshell-aliases-file (expand-file-name "aliases" eshell-directory-name))
  :bind
  (("<leader> oe" . eshell)
   :map eshell-mode-map
   ("C-p" . eshell-previous-input)
   ("C-n" . eshell-next-input)
   ("C-l" . eshell/clear)))

(provide 'init-eshell)
;;; init-eshell.el ends here
#+end_src

Eshell aliases.
#+begin_src txt :tangle "eshell/aliases" :mkdirp yes
alias f find-file $1
alias f find-file $1
alias ft find-file-other-tab $1
alias fF find-file-other-frame $1
alias d dired $1
alias dt dired-other-tab $1
alias df dired-other-frame $1
alias b switch-to-buffer
#+end_src

I'm trying the [[https://codeberg.org/akib/emacs-eat][EAT]] terminal.

#+begin_src emacs-lisp :tangle "lisp/init-eat.el" :mkdirp yes
;;; init-eat.el -*- lexical-binding: t; -*-
(use-package eat
  :ensure (:host codeberg :repo "akib/emacs-eat")
  :init 
  (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)
  :bind
  (("<leader> ot" . eat)))

(provide 'init-eat)
;;; init-eat.el ends here
#+end_src

Remember to add the following to the ~.bashrc~
#+begin_src bash
[ -n "$EAT_SHELL_INTEGRATION_DIR" ] && \
  source "$EAT_SHELL_INTEGRATION_DIR/bash"
#+end_src

** Setup for programming languages 
As said in the beginning, each language is configured separately.
The per-language configuration lives inside the ~/lisp/langs~ directory.
This module is pretty simple, setup a basic config for ~eglot~ (the LSP client builtin in emacs) and create a function to load all the languages configs from a list of candidates.
#+begin_src emacs-lisp :tangle "lisp/init-prog.el" :mkdirp yes 
;;; init-prog.el -*- lexical-binding: t; -*-

(add-to-list 'load-path (expand-file-name "lisp/langs/" user-emacs-directory))

(use-package eglot
  :ensure nil
  :functions (eglot-ensure)
  :commands (eglot)
  :config
  (setq eglot-autoshutdown t))

(defun nto/enable-languages (languages)
  (dolist (lang languages)
    (require (intern (format "%s-setup" lang)))))

(provide 'init-prog)
;;; init-prog.el ends here
#+end_src


*** Clojure  
This module has the following dependencies:
- [[https://github.com/clj-kondo/clj-kondo][clj-kondo]]
- [[https://github.com/weavejester/cljfmt][clj-fmt]]
- [[https://github.com/babashka/neil][neil]]

#+begin_src emacs-lisp :tangle "lisp/langs/clojure-setup.el" :mkdirp yes
;;; clojure-setup.el -*- lexical-binding: t; -*-

(use-package paredit
  :ensure t)

(use-package parseclj
  :ensure t)

(use-package parseedn
  :ensure t)

(use-package clojure-ts-mode
  :ensure t
  :hook
  ((clojure-mode . subword-mode)
   (clojure-mode . eldoc-mode)
   (clojure-mode . cider-mode))
  :init
  (evil-define-key nil clojure-mode-map
    (kbd "<localleader> '") #'cider-jack-in-clj
    (kbd "<localleader> \"") #'cider-jack-in-cljs
    (kbd "<localleader> m") #'cider-macroexpand-1
    (kbd "<localleader> M") #'cider-macroexpand-all
    (kbd "<localleader> d") #'cider-debug-defun-at-point
    (kbd "<localleader> eb") #'cider-eval-buffer
    (kbd "<localleader> ed") #'cider-eval-defun-at-point
    (kbd "<localleader> ee") #'cider-eval-last-sexp
    (kbd "<localleader> er") #'cider-eval-region
    (kbd "<localleader> hj") #'cider-javadoc
    (kbd "<localleader> hc") #'cider-clojuredocs
    (kbd "<localleader> hn") #'cider-find-ns
    (kbd "<localleader> ha") #'cider-apropos
    (kbd "<localleader> hd") #'cider-doc
    (kbd "<localleader> hw") #'cider-clojuredocs-web
    (kbd "<localleader> nn") #'cider-browse-ns
    (kbd "<localleader> nN") #'cider-browse-ns-all
    (kbd "<localleader> nr") #'cider-ns-refresh
    (kbd "<localleader> nR") #'cider-ns-reload
    (kbd "<localleader> pp") #'cider-pprint-eval-last-sexp
    (kbd "<localleader> pP") #'cider-pprint-eval-last-sexp-to-comment
    (kbd "<localleader> q")  #'cider-quit
    (kbd "<localleader> r")  #'cider-restart
    (kbd "<localleader> tp") #'cider-test-run-project-tests
    (kbd "<localleader> tr") #'cider-test-rerun-failed-tests
    (kbd "<localleader> tt") #'cider-test-run-test))

(use-package clj-refactor
  :ensure t
  :after clojure
  :hook (clojure-mode . clj-refactor-mode)
  :config
  (evil-define-key nil clojure-mode-map
    (kbd "<localleader> r") #'hydra-cljr-help-menu/body))

(use-package cider
  :ensure t
  :after clojure
  :config 
  (setq nrepl-hide-special-buffers t
        nrepl-log-messages nil
        cider-repl-display-help-banner nil
        cider-font-lock-dynamically '(macro core function var deprecated)
        cider-overlays-use-font-lock t
        cider-print-options '(("length" 100))
        cider-prompt-for-symbol nil
        cider-repl-history-display-duplicates nil
        cider-repl-history-display-style 'one-line
        cider-repl-history-file (concat doom-cache-dir "cider-repl-history")
        cider-repl-history-highlight-current-entry t
        cider-repl-history-quit-action 'delete-and-restore
        cider-repl-history-highlight-inserted-item t
        cider-repl-history-size 1000
        cider-repl-result-prefix ";; => "
        cider-repl-use-clojure-font-lock t
        cider-repl-use-pretty-printing t
        cider-repl-wrap-history t
        cider-stacktrace-default-filters '(tooling dup)
        cider-repl-pop-to-buffer-on-connect 'display-only))

(use-package neil
  :commands (neil-find-clojure-package)
  :config
  (setq neil-prompt-for-version-p nil
        neil-inject-dep-to-project-p t)
  (evil-define-key nil clojure-mode-map 
        (kbd "<localleader> f")  #'neil-find-clojure-package))

(provide 'clojure-setup)
;;; clojure-setup.el ends here
#+end_src

*** Emacs Lisp
For now it is empty.
#+begin_src emacs-lisp :tangle "lisp/langs/emacs-lisp-setup.el" :mkdirp yes
;;; emacs-lisp-setup.el -*- lexical-binding: t; -*-

(provide 'emacs-lisp-setup)
;;; emacs-lisp-setup.el ends here
#+end_src

